:PROPERTIES:
:ID:       e4ce0aba-aa5a-4fa6-ad75-a52f4693e828
:END:
#+title: cpp-compiler

#+begin_src C++ :results raw 
#include

#+end_src

#+begin_src C++ :results output 
#include <iostream>
using namespace std;
int main() {
cout << "Babel C++" << endl;
}

#+end_src

#+RESULTS:
: Babel C++
